app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @quote = Quote.order("RANDOM()").first

INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["saying", "Don't let poverty be the reason you are humble"], ["author", "Opus Jnr"], ["created_at", "2019-10-30 00:58:37.462694"], ["updated_at", "2019-10-30 00:58:37.462694"]]
---
  def create
    Quote.create(quote_params)